//Факултетен номер: 1901322007	Николай	Костадинов	Лютаков

//3.7) В една земеделска ферма се прави малка програма за работа с кравите.
//Всяка крава се описва с номер, година на раждане, брой родени телета и(среден) млеконадой(реално число).
//Изведете информация за : всички крави; кравите, които имат млеконадой над 15; 
//кравите  с максимален и минимален млеконадой, родени през 2017 г.; 
//средно - аритметично на млеконадоя над 25.5.

#include <iostream>

using namespace std;

// Функция която изпечатва на конзолата информация за всичките крави във фермата.
int allCowsPrinter(int a[], int b[], int c[], float d[]) 
{
	cout << "Списък с всички крави:" << endl;
	for (int i = 0; i < 10; i++)
	{
		cout << "Крава номер: " << a[i] << "; Година на раждане: " << b[i] << "; Брой родени телета: " << c[i] << "; Млеконадой: " << d[i] << endl;

	}
	cout << endl;
	return 0;
}

// Функция която изпечатва на конзолата информация за кравите, които имат млеконадой над 15.
int midCowsPrinter(int a[], int b[], int c[], float d[])
{

	cout << "Крави с млеконадой над 15:" << endl;

	for (int i = 0; i < 10; i++)
	{
		if (d[i] > 15)
		{
			cout << "Крава номер: " << a[i] << "; Година на раждане: " << b[i] << "; Брой родени телета: " << c[i] << "; Млеконадой: " << d[i] << endl;
		}
	}
	cout << endl;
	return 0;
}
// Функция която изпечатва наконзолата информация за кравите с максимален и минимален
// млеконадой, родени през 2017 г.
int maxMinMilkPrinter(int a[], int b[], int c[], float d[])
{

	cout << "Крави родени през 2017:" << endl;

	int min = -1;
	int max = -1;


	for (int i = 0; i < 10; i++)
	{
		
		if (b[i] == 2017)
		{
			if (min == -1 && max == -1)
			{
				min = i;
				max = i;
			}

			if (d[i] > d[max])
			{
				max = i;
			}

			if (d[i] < d[min])
			{
				min = i;
			}

			
		}
		
	}

	cout << "Крава с минимален млеконадой: " << "Крава номер: " << a[min] << "; Година на раждане: " << b[min] << "; Брой родени телета: " << c[min] << "; Млеконадой: " << d[min] << endl;
	cout << "Крава с максимален млеконадой: " <<"Крава номер: " << a[max] << "; Година на раждане: " << b[max] << "; Брой родени телета: " << c[max] << "; Млеконадой: " << d[max] << endl;
	cout << endl;
	return 0;
}

// Функция която изпечатва на конзолата средно аритметично на млеконадоя над 25.5.
int aritmeticPrinter(int a[], int b[], int c[], float d[]) 
{ 
	int cnt = 0;
	float sum = 0;
	float comparator = 25.5;

	for (int i = 0; i < 10; i++)
	{
		if (d[i] > comparator)
		{
			sum += d[i];
			cnt++;
		}
	}

	float aritmetic = sum / cnt;
	cout << "Средно аритметично на млеконадоя над 25.5 = " << aritmetic << endl;
	cout << endl;
	return 0;
} 

int main()
{
	setlocale(LC_ALL, "Bg");

	// Декларация на масивите в които ще се съдържа информацията за кравите.
	int cowNumber[10]{1, 2, 3, 4, 5, 6, 7, 8, 9, 10};
	int yearBorn[10]{2016, 2015, 2017, 2016, 2017, 2015, 2017, 2016, 2017, 2018};
	int childsBorn[10]{1, 5, 3, 6, 2, 1, 3, 1, 2, 4};
	float milkGiven[10]{29.4, 15.0, 15.5, 16.2, 17.5, 26.1, 12.3, 14.9, 11.9, 27.2};

	// Извикване на функцията за изпечатване на всички крави във фермата.
	allCowsPrinter(cowNumber, yearBorn, childsBorn, milkGiven);
	
	// Извикване на функцията за изпечатване на кравите с млеконадой над 15.
	midCowsPrinter(cowNumber, yearBorn, childsBorn, milkGiven);
	
	// Извикване на функцията за изпечатване на кравите с максимален и минимален млеконадой родени през 2017 г.
	maxMinMilkPrinter(cowNumber, yearBorn, childsBorn, milkGiven);

	// Извикване на функцията за изпечатване средно аритметично на млеконадоя над 25.5. 
	aritmeticPrinter(cowNumber, yearBorn, childsBorn, milkGiven);
}
